# ProhibitSwitchFromIssuedRevision Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RevisionCloudFailures..::..ProhibitSwitchFromIssuedRevision Property
BuiltInFailures..::..RevisionCloudFailures Class See Also
---
Can't remove cloud from an Issued Revision.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ProhibitSwitchFromIssuedRevision { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ProhibitSwitchFromIssuedRevision As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ProhibitSwitchFromIssuedRevision {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RevisionCloudFailures Class
Autodesk.Revit.DB Namespace